<template>
    <div class="bg-slate-100 prose w-auto max-w-none px-32 py-16 flex flex-col gap-8">
        <h1>О проекте</h1>
        <div class="about-block">
            <h2>Отзывус</h2>
            <p> Создан инициативными студентами Тюменского государственного университета, чтобы помочь обучающимся
                осознаннее
                выбирать элективы, опираясь на реальные отзывы других студентов, а преподавателям и управлению
                индивидуальных
                образовательных траекторий – делать выводы для дальнейшего развития элективного пространства.</p>
            <h2>Ценности сервиса</h2>
            <ol>
                <li><b>Уважение</b> - мы должны уважать всех пользователей нашего сервиса, обеспечивать справедливость и
                    равенство.</li>
                <li><b>Безопасность</b> - мы должны обеспечивать безопасность нашего сервиса и защищать пользователей от
                    любых
                    угроз.</li>
                <li><b>Открытость</b> - мы должны быть открыты к конструктивной критике и готовы реагировать на отзывы наших
                    пользователей, чтобы постоянно улучшать наш сервис.</li>
                <li><b>Последовательность</b> - мы должны быть последовательными в своих действиях и решениях, чтобы наши
                    пользователи могли доверять нам.</li>
            </ol>
        </div>
        <div class="about-block">
            <h2>Наша команда</h2>
            <div class="mx-2 px-2 flex gap-4 justify-around">
                <div>
                    <img class="student-photo" src="" alt="Фото студента">
                    <p>Фамилия Имя Отчество</p>
                </div>
                <div>
                    <img class="student-photo" src="" alt="Фото студента">
                    <p>Фамилия Имя Отчество</p>
                </div>
                <div>
                    <img class="student-photo" src="" alt="Фото студента">
                    <p>Фамилия Имя Отчество</p>
                </div>
                <div>
                    <img class="student-photo" src="" alt="Фото студента">
                    <p>Фамилия Имя Отчество</p>
                </div>
            </div>
            <p class="text-center">Студенты бакалавриата Математическое обеспечение и администрирование информационных
                систем, 2021 год поступления</p>
        </div>
    </div>
</template>

<script setup>
useHead({
    title: "О проекте"
})
</script>

<style scoped>
.about-block {
    @apply bg-white px-8 pb-4 shadow-lg;
}

.student-photo {
    @apply rounded-full border-2 aspect-square text-center overflow-hidden font-bold;
}
</style>