<template>
    <div class="flex flex-col place-content-center p-8 gap-4">
        <p class="text-8xl text-center">Frontend-разработчик</p>
        <p class="text-5xl text-center">от компании SkillBrains</p>
    </div>
    <p class="text-2xl text-center">Это общее мнение пользователей, вычисленное нашей нейросетью</p>
    <div class="m-auto ms-16 my-8 px-8 flex flex-wrap gap-8 place-content-center">
        <div>
            <p class="text-9xl aspect-square shadow-lg rounded-xl bg-green-200 p-4">4.8</p>
        </div>
        <div class="w-1/2 flex flex-col gap-4">
            <div class="shadow-lg rounded-xl p-2 bg-green-200">
                <div v-for="phrase in frontend.pos" class="p-2">
                    <p>"{{ phrase }}"</p>
                </div>
            </div>
            <div class="shadow-lg rounded-xl p-2 bg-red-200">
                <div v-for="phrase in frontend.neg" class="p-2">
                    <p>"{{ phrase }}"</p>
                </div>
            </div>
        </div>
    </div>
    <p class="text-2xl text-center pt-8 pb-12">А это реальные отзывы пользователей</p>
    <div class="grid grid-cols-2 gap-16 px-32">
        <div v-for="rew in frontend_rews" class="border-4 px-8 py-6 rounded-xl">
            <p class="prose-lg">{{ rew.name }}</p>
            <p class="prose">{{ rew.createdToMoscow.slice(0, 10) }}</p>
            <p class="prose text-center pt-4">{{ rew.text }}</p>
        </div>
    </div>
</template>

<script setup>
const frontend = {
    "neg": [
        "лично я ничего не увидел за что можно было заплатить",
        "сама платформа для обучения постоянно лагает и полна багов",
        "посмотреть более поздние материалы у меня не было возможности",
        "точное количество занятий в этих модулях мне не сообщили",
        "но менторы из них это вообще бред какой то"
    ],
    "pos": [
        "в любом случае преподаватели оставляют много ссылок на дополнительные материалы",
        "дают много теории и к каждому уроку есть практическое задание",
        "предлагает студентам реальные проекты и задачи для практического опыта",
        "данный курс помог заполнить пробелы и узнать много нового",
        "а в уроке все по делу и без воды"
    ]
}
const frontend_rews = [
    {
        "name": "Аноним",
        "reviewObjectId": "Skillfactory",
        "specificProductName": "Frontend-разработчик",
        "rating": 5,
        "text": "Всем доброго времени суток! На данный момент я учусь на frontend-разработчика в школе skillfactory.\n\nСфера IT меня давно интересовала и наконец то появилась возможность попробовать себя в новой профессии. На данный момент я стараюсь совместить две учебы, а именно обучение на лингвиста и онлайн курсы. Честно говоря, в идеале все свое свободное время нужно уделять доп. образованию, чтобы максимально качественно усвоить материал. Лично у меня иногда бывают с этим сложности, однако тут хочется поблагодарить менторов, которые максимально быстро отвечают на все вопросы. Это было для меня приятной неожиданностью!\n\nПо поводу платформы хочется сказать, что я попалась на момент ее глобального обновления, поэтому были иногда сбои в работе, однако сейчас такого не наблюдается и в целом интерфейс стал намного приятнее.\n\nСейчас я нахожусь на половине своего пути. Мне многое еще предстоит, но я рада, что начала обучение в совершенно новой для себя сфере! Оказывается даже айти сфера посильна при должном внимании!",
        "createdToMoscow": "2023-10-09T19:41:18.247227Z"
    },
    {
        "name": "Аноним",
        "reviewObjectId": "Skillfactory",
        "specificProductName": "Frontend-разработчик",
        "rating": 5,
        "text": "Я прохожу курс Frontend-developer.\nРаботаю в золотодобывающей промышленности, планирую перейти в сферу ИТ, для этого выбрал школу Skillfactory. Проходя основной курс есть возможность прохождения дополнительных подарочных курсов.\nУдобно что в случае возникновения производственной необходимости есть возможность поставить обучение на паузу, надолго лучше не затягивать и хотя бы иногда по возможности повторять пройденный материал. Сложностей пока не возникало, всегда на все запросы отвечают быстро, помогают в том числе и сообщество отзывчивое это как большая дружная компания людей занимающихся интересным и любимым делом.\nВ подарочных курсах узнал много интересного об ИИ, теперрь буду прововать встраивать его в свою повседневную жизнь и работу.\nВремя учебы можно выбрать удобное для себя и осваивать материалы без спешки.",
        "createdToMoscow": "2023-09-23T09:49:22.818535Z"
    },
    {
        "name": "Аноним",
        "reviewObjectId": "Skillbox",
        "specificProductName": "Frontend-разработчик",
        "rating": 5,
        "text": "Обучалась на курсе профессиональной переподготовки \"Frontend-разработчик\" с нуля без каких-либо знаний в этой сфере. Хотела попробовать свои силы и мне очень понравилось.\nЗамечательные видио-уроки, приятно смотреть и легко, структурированная подача материала, все четко по делу. После каждой темы д/з, по итогам модулей промежуточные аттестации. Кураторы проверяют и отвечают на все вопросы. Координатор периодически связывается, узнает есть ли сложности/вопросы/проблемы и помогает.\n В целом сложилось хорошее впечатление о Skillbox, информативные и интересные модули, приятное общение, все есть для комфортного обучения👌🏻",
        "createdToMoscow": "2023-08-31T22:19:01.596847Z"
    },
    {
        "name": "Аноним",
        "reviewObjectId": "Skillbox",
        "specificProductName": "Frontend-разработчик",
        "rating": 5,
        "text": "Обучалась по программе профессиональной переподготовки «Frontend-разработчик». Пришла с базовыми знаниями по верстке и JS, данный курс помог заполнить пробелы и узнать много нового. Процесс обучения построен очень хорошо, дается достаточное количество теории, плюс ссылки на учебный материал, что помогает глубже изучить конкретную тему. Домашние задания проверяются кураторами, которые всегда помогут, если возникают трудности. Также по каждому курсу есть чаты, где можно задать интересующие вопросы по темам и пообщаться с единомышленниками. Отдельное спасибо, хочется сказать координаторам обучения, которые звонили, интересовались как проходит учеба и подбадривали:) Я осталась довольна обучением!",
        "createdToMoscow": "2023-08-07T16:40:49.416314Z"
    },
    {
        "name": "Аноним",
        "reviewObjectId": "Skillbox",
        "specificProductName": "Frontend-разработчик",
        "rating": 5,
        "text": "Отличный курс! Закончил учебную программу по профессиональной переподготовке на frontend-разработчика. Пришел на SKILLBOX с неплохим опытом javascript, react, nodejs. Хотелось освоить фреймворк vue для разработки реактивных веб приложений. Курс дает приличную базу веб разработчика. Хочу выделить опытных кураторов, которые проверяли мои работы и показывали мне мои ошибки, говорили как лучше написать код, какие библиотеки подключить и тд. Общение с опытными наставниками многого стоит. К моему удвилению, в финальных аттестационных работах еще и получил хороший опыт разработки боевых проектов: интернет магазин (верстка), mvp веб-приложиние операций с криптовалютой(js), а так же интернет магазин на vue2 с миграцией на vue3. Рекомендую всем, кто хочет хорошей практики!)",
        "createdToMoscow": "2023-07-21T20:14:35.90578Z"
    },
    {
        "name": "Аноним",
        "reviewObjectId": "Skillbox",
        "specificProductName": "Frontend-разработчик",
        "rating": 5,
        "text": "Добрый день! Я проходила курс frontend-разработчика в Skillbox. Мне понравился формат обучения в этой онлайн-школе - можно учится в свободное время, сначала просматривать видео, потом выполнять практические задания. Практические задания проверяют кураторы, у них же можно спросить о том, что непонятно. Так же есть чаты по модулям, где тоже могут дать совет и разобрать то,что не получается. Все кураторы, которые мне попадались - прекрасные, никаких недопониманий не возникало. В конце каждого модуля промежуточная аттестация - это объемная и красивая работа, которую я добавлю в портфолио. Обучение насыщенное, информации много,особенно для тех кто с нуля, но с первых же занятий обучение захватывает, над практическими работами порой приходится \"поломать\" голову, но от этого интеснее обучение. Рекомедую Skillbox!!!",
        "createdToMoscow": "2023-07-20T13:43:51.490151Z"
    },
    {
        "name": "Аноним",
        "reviewObjectId": "Geekbrains",
        "specificProductName": "Frontend-разработчик: быстрый старт в профессии (Специалист)",
        "rating": 5,
        "text": "Раньше хотел стать программистом и наконец решил отучиться на FrontEnd разработчика. Знакомый программист посоветовал площадку GeekBrains.  О GeekBrains знаю давно, но решился учиться программированию только сейчас. Очень рад, что это сделал. С первых занятий мне импонировали люди, преподаватели. Очень интересный материал, который довольно хорошо подается. Наконец-то я учусь! Это не может не радовать. Впереди еще много, что нужно изучить и это очень круто!",
        "createdToMoscow": "2023-06-28T17:48:55.149646Z"
    },
    {
        "name": "Аноним",
        "reviewObjectId": "Нетология",
        "specificProductName": "Frontend-разработчик с нуля до middle",
        "rating": 5,
        "text": "Прохожу обучение по профессии Frontend-разработчик с нуля до midle. До окончания осталось пару блоков (уже 14 месяцев учусь=)).\n\nДают много теории и к каждому уроку есть практическое задание. Некоторые темы в заданиях сквозные. То есть один раз объяснили, показали как делать и потом в каждом следующем задании требуется это применять (например сборка Webpack, Jest-тесты, CI/CD, Git и т.п.). Получается, что даже если с ходу не разобрался потихоньку всё равно дойдёт=) Много заданий применимых на практике (добавление товаров в карзину с простинькой анимацией, карусель картинок, адаптивная вёрстка и т.п.). Есть офщий чат в diskord где можно задавать любые вопросы по обучению. Удобно.\n\nДо этого проходил курсы по PHP в ВУЗе, который заканчивал в Томске (не хочется говорить плохо про любимый ВУЗ, потому не пишу какой именно). Там о такой поддержке и качестве материалов и речи не шло... Скидывали какие-то книжки, преподаватель был один, проверял всё неделями... В Нетологии иной раз в течении часа-двух работу проверяют.\n\nВ общем впечатление положительное. Рекомендую=)",
        "createdToMoscow": "2023-06-21T13:17:59.843973Z"
    },
    {
        "name": "Аноним",
        "reviewObjectId": "Geekbrains",
        "specificProductName": "Frontend-разработчик (Специалист)",
        "rating": 5,
        "text": "Платформа GeekBrains предлагает широкий спектр обучающего контента. Содержание курса включает видеоуроки, практические упражнения, интерактивные редакторы кода, викторины и другие практические инструменты. Этот контент предлагается на разных уровнях, от новичков до опытных программистов.\n\nПредлагает студентам реальные проекты и задачи для практического опыта. Это позволяет студентам применять теорию на практике и помогает им развивать свои навыки программирования. В результате опыта GeekBrains студенты получают официальные сертификаты. Эти сертификаты подтверждают навыки программирования студентов и дают им преимущество при приеме на работу.",
        "createdToMoscow": "2023-05-23T19:44:59.724966Z"
    },
    {
        "name": "Аноним",
        "reviewObjectId": "ProductStar",
        "specificProductName": "Профессия: Frontend-разработчик",
        "rating": 5,
        "text": "Я только недавно начал обучение на курсе \"Frontend\", всего месяц назад. Однако я уже стою на пороге больших возможностей! Часто с возрастом мы забываем о своих детских мечтах и о том, кем хотели стать. Но со временем я вспомнил свою истинную страсть. Разработка и создание пользовательских интерфейсов всегда присутствовали в моей жизни в разной форме. Поэтому я решил записаться на курсы ProductStar после того, как услышал положительные отзывы о них от моих близких друзей. Без колебаний я отправил заявку и с нетерпением ждал ответа.\n\nМне позвонили из центра и рассказали мне о курсе, его преподавателях (директоре и топ-менеджерах собственных студий) и предоставили информацию о возможности рассрочки оплаты. Я потратил несколько часов, изучая информацию на их лендинге и сравнивая ее с другими предложениями. Мне понравилось то, что после окончания курса я смогу уже иметь свое собственное портфолио. Также здесь есть активное студенческое сообщество, где мы можем общаться и обмениваться идеями. Приятным бонусом является наличие Карьерного центра, который помогает готовиться к новой карьере и поиску работы уже во время обучения.",
        "createdToMoscow": "2023-05-23T12:25:07.434272Z"
    }
]
</script>

<style scoped></style>